tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SINC.h
/* The count of SINC_CMPDATA */
#define SINC_CMPDATA_COUNT                       (4U)

/*! @name CACFR - Channel 0 Advanced Configuration..Channel 3 Advanced Configuration */
/*! @{ */

#define SINC_CACFR_ADMASEL_MASK                  (0xF000U)
#define SINC_CACFR_ADMASEL_SHIFT                 (12U)
/*! ADMASEL - Alternate DMA Source Selection
 *  0b0000..Alternate DMA disabled
 *  0b0001..PF conversion complete
 *  0b0010..PF data output ready
 *  0b0011..Zero crossing detected
 *  0b0100..Short circuit detected
 *  0b0101..Window limit detected
 *  0b0110..Low limit detected
 *  0b0111..High limit
 *  0b1000..FIFO underflow
 *  0b1001..FIFO overflow
 *  0b1010..Clock absence
 *  0b1011..Saturation
 */
#define SINC_CACFR_ADMASEL(x)                    (((uint32_t)(((uint32_t)(x)) << SINC_CACFR_ADMASEL_SHIFT)) & SINC_CACFR_ADMASEL_MASK)

#define SINC_CACFR_HPFA_MASK                     (0xF0000U)
#define SINC_CACFR_HPFA_SHIFT                    (16U)
/*! HPFA - HPF DC Remover Alpha Coefficient */
#define SINC_CACFR_HPFA(x)                       (((uint32_t)(((uint32_t)(x)) << SINC_CACFR_HPFA_SHIFT)) & SINC_CACFR_HPFA_MASK)

#define SINC_CACFR_IBDLY_MASK                    (0xF00000U)
#define SINC_CACFR_IBDLY_SHIFT                   (20U)
/*! IBDLY - Input Modulator Bitstream Delay
 *  0b0000..Disabled
 *  *..Delay in clock cycles
 */
#define SINC_CACFR_IBDLY(x)                      (((uint32_t)(((uint32_t)(x)) << SINC_CACFR_IBDLY_SHIFT)) & SINC_CACFR_IBDLY_MASK)

#define SINC_CACFR_PTMUX_MASK                    (0x1F000000U)
#define SINC_CACFR_PTMUX_SHIFT                   (24U)
/*! PTMUX - Pulse Trigger Mux Select
 *  0b00000..Disabled; outputs 0
 *  0b00001..Asserts H_LIM_OUT
 *  0b00010..Asserts L_LIM_OUT
 *  0b00011..Asserts LIM_OUT
 *  0b00100..Asserts W_LIM_OUT
 *  0b00101..Asserts ZC_OUT
 *  0b00110..Asserts ZC_OUT_inv
 *  0b00111..Asserts RS_LIM_OUT
 *  0b01000..Asserts RS_LIM_OUT_inv
 *  0b01001..Channel raw input modulator bitstream
 *  0b01010..Channel raw input modulator clock
 *  0b01011..Channel output recovered modulator bitstream
 *  0b01100..Channel output recovered modulator clock
 *  0b01101..Asserts H_LIM_TRG
 *  0b01110..Asserts L_LIM_TRG
 *  0b01111..Asserts LIM_TRG
 *  0b10000..Asserts W_LIM_TRG
 *  0b10001..Asserts HL_LIM_TRG
 *  0b10010..Zero cross rise pulse signal
 *  0b10011..Zero cross fall pulse signal
 *  0b10100..Zero cross rise and fall pulse signal
 *  0b10101..FIFO watermark ok pulse signal
 *  0b10110..FIFO overflow pulse signal
 *  0b10111..FIFO underflow pulse signal
 *  0b11000..FIFO empty pulse signal
 *  0b11001..Clock monitor assert pulse signal
 *  0b11010..Short circuit assert pulse signal
 *  0b11011..Saturation pulse signal
 *  0b11100..Conversion complete pulse signal
 */
#define SINC_CACFR_PTMUX(x)                      (((uint32_t)(((uint32_t)(x)) << SINC_CACFR_PTMUX_SHIFT)) & SINC_CACFR_PTMUX_MASK)
/*! @} */

/* The count of SINC_CACFR */
#define SINC_CACFR_COUNT                         (4U)

/*! @name CSR - Channel 0 Status..Channel 3 Status */
/*! @{ */

#define SINC_CSR_FIFOAVIL_MASK                   (0x1FU)
#define SINC_CSR_FIFOAVIL_SHIFT                  (0U)
/*! FIFOAVIL - FIFO Available Data */
#define SINC_CSR_FIFOAVIL(x)                     (((uint32_t)(((uint32_t)(x)) << SINC_CSR_FIFOAVIL_SHIFT)) & SINC_CSR_FIFOAVIL_MASK)

#define SINC_CSR_PSRDY_MASK                      (0x80U)
#define SINC_CSR_PSRDY_SHIFT                     (7U)
/*! PSRDY - Parallel or Serial Data Ready
 *  0b0..Not ready
 *  0b1..Ready
 */
#define SINC_CSR_PSRDY(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_CSR_PSRDY_SHIFT)) & SINC_CSR_PSRDY_MASK)

#define SINC_CSR_PFSAT_MASK                      (0x100U)
#define SINC_CSR_PFSAT_SHIFT                     (8U)
/*! PFSAT - Primary CIC Saturation Flag
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define SINC_CSR_PFSAT(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_CSR_PFSAT_SHIFT)) & SINC_CSR_PFSAT_MASK)

#define SINC_CSR_HPFSAT_MASK                     (0x200U)
#define SINC_CSR_HPFSAT_SHIFT                    (9U)
/*! HPFSAT - HPF Saturation Flag
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define SINC_CSR_HPFSAT(x)                       (((uint32_t)(((uint32_t)(x)) << SINC_CSR_HPFSAT_SHIFT)) & SINC_CSR_HPFSAT_MASK)

#define SINC_CSR_SFTSAT_MASK                     (0x400U)
#define SINC_CSR_SFTSAT_SHIFT                    (10U)
/*! SFTSAT - Shift Saturation Flag
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define SINC_CSR_SFTSAT(x)                       (((uint32_t)(((uint32_t)(x)) << SINC_CSR_SFTSAT_SHIFT)) & SINC_CSR_SFTSAT_MASK)

#define SINC_CSR_BIASSAT_MASK                    (0x800U)
#define SINC_CSR_BIASSAT_SHIFT                   (11U)
/*! BIASSAT - Bias Saturation Flag
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define SINC_CSR_BIASSAT(x)                      (((uint32_t)(((uint32_t)(x)) << SINC_CSR_BIASSAT_SHIFT)) & SINC_CSR_BIASSAT_MASK)

#define SINC_CSR_RDRS_MASK                       (0x1000U)
#define SINC_CSR_RDRS_SHIFT                      (12U)
/*! RDRS - Result Data Direct Read Status
 *  0b0..Valid
 *  0b1..Invalid
 */
#define SINC_CSR_RDRS(x)                         (((uint32_t)(((uint32_t)(x)) << SINC_CSR_RDRS_SHIFT)) & SINC_CSR_RDRS_MASK)

#define SINC_CSR_SRDS_MASK                       (0x2000U)
#define SINC_CSR_SRDS_SHIFT                      (13U)
/*! SRDS - Start Read Debug Data Sync
 *  0b0..Data valid
 *  0b0..No effect
 *  0b1..Procedure in progress
 *  0b1..Starts the procedure
 */
#define SINC_CSR_SRDS(x)                         (((uint32_t)(((uint32_t)(x)) << SINC_CSR_SRDS_SHIFT)) & SINC_CSR_SRDS_MASK)

#define SINC_CSR_DBGRS_MASK                      (0xC000U)
#define SINC_CSR_DBGRS_SHIFT                     (14U)
/*! DBGRS - Debug Data Read Status
 *  0b00..Valid
 *  0b01-0b11..Invalid
 */
#define SINC_CSR_DBGRS(x)                        (((uint32_t)(((uint32_t)(x)) << SINC_CSR_DBGRS_SHIFT)) & SINC_CSR_DBGRS_MASK)

#define SINC_CSR_CNUM_MASK                       (0x7F0000U)
#define SINC_CSR_CNUM_SHIFT                      (16U)
/*! CNUM - Number Of Conversions */
#define SINC_CSR_CNUM(x)                         (((uint32_t)(((uint32_t)(x)) << SINC_CSR_CNUM_SHIFT)) & SINC_CSR_CNUM_MASK)

#define SINC_CSR_CNUM_OV_MASK                    (0x800000U)
#define SINC_CSR_CNUM_OV_SHIFT                   (23U)
/*! CNUM_OV - Overflow In Number Of Conversions
 *  0b0..No overflow
 *  0b1..Overflow
 */
#define SINC_CSR_CNUM_OV(x)                      (((uint32_t)(((uint32_t)(x)) << SINC_CSR_CNUM_OV_SHIFT)) & SINC_CSR_CNUM_OV_MASK)
/*! @} */

/* The count of SINC_CSR */
#define SINC_CSR_COUNT                           (4U)

/*! @name CDBGR - Channel 0 Debug..Channel 3 Debug */
/*! @{ */

#define SINC_CDBGR_DBGDATA_MASK                  (0xFFFFFFFFU)
#define SINC_CDBGR_DBGDATA_SHIFT                 (0U)
/*! DBGDATA - Debug Data */
#define SINC_CDBGR_DBGDATA(x)                    (((uint32_t)(((uint32_t)(x)) << SINC_CDBGR_DBGDATA_SHIFT)) & SINC_CDBGR_DBGDATA_MASK)
/*! @} */

/* The count of SINC_CDBGR */
#define SINC_CDBGR_COUNT                         (4U)


/*!
 * @}
 */ /* end of group SINC_Register_Masks */


/*!
 * @}
 */ /* end of group SINC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SINC_H_ */

